{
  "Criterion 1: Centering instruction on high expectations for student achievement.": {
    "P1": {
      "component": "Learning target(s) connected to standards",
      "distinguished": "Distinguished – 4 Lessons are not based on grade level standards or there are no learning targets aligned to the standard or the targets do not change daily. Lessons are based on grade level standards. The daily learning target(s) align to the standard. Lessons are based on grade level standards. The daily learning target(s) align to the standard. Students can rephrase the learning target(s) in their own words. Lessons are based on grade level standards. The daily learning target(s) align to the standard. Students can rephrase the learning target(s) in their own words. Students can explain why the learning target(s) are important."
    },
    "P4": {
      "component": "Communication of learning target(s)",
      "distinguished": "Distinguished – 4 Teacher rarely states or communicates with students about the learning target(s). Teacher states the learning target(s) once during the lesson and checks for student understanding of the learning target(s). Teacher communicates the learning target(s) through verbal and visual strategies and checks for student understanding of the learning target(s). Teacher communicates the learning target(s) through verbal and visual strategies, checks for student understanding of the learning target(s), and references the target(s) throughout instruction."
    },
    "P5": {
      "component": "Success criteria",
      "distinguished": "Distinguished – 4 The success criteria for the learning target(s) are nonexistent or vague. Success criteria are present but may lack alignment to the learning target(s) and/or may not be used by students for learning. Success criteria are present and align to the learning target(s). With prompting from the teacher, students use the success criteria to communicate what they are learning. Success criteria are present and align to the learning target(s). Students use the success criteria to communicate what they are learning."
    }
  },
  "Criterion 2: Demonstrating effective teaching practices.": {
    "CEC2": {
      "component": "Learning routines",
      "distinguished": "Distinguished – 4 Learning routines for discussion and collaborative work are absent. Learning routines for discussion and collaborative work are present but may not result in effective Learning routines for discussion and collaborative work are present, and result in effective discourse. Learning routines for discussion and collaborative work are present, and result in effective discourse.   discourse. Students are held accountable for completing their work but not for learning. Students are held accountable for completing their work and for learning. Students independently use the routines during the lesson. Students are held accountable for completing their work and for learning. Students support the learning of others."
    },
    "SE1": {
      "component": "Quality of questioning",
      "distinguished": "Distinguished – 4 Teacher does not ask questions to probe and deepen student understanding or uncover misconceptions. Teacher asks questions to probe and deepen student understanding or uncover misconceptions. Teacher asks questions to probe and deepen student understanding or uncover misconceptions. Teacher assists students in clarifying their thinking with one another. Teacher asks questions to probe and deepen student understanding or uncover misconceptions. Teacher assists students in clarifying and assessing their thinking with one another. Students question one another to probe for deeper thinking."
    },
    "SE4": {
      "component": "Opportunity and support for participation and meaning making",
      "distinguished": "Distinguished – 4 Teacher does not use engagement strategies and structures that facilitate participation and meaning making by students. Few students have the opportunity to engage in discipline-specific meaning making. Teacher uses engagement strategies and structures that facilitate participation and meaning making by students. Some students have the opportunity to engage in discipline-specific meaning making. Teacher sets expectations and provides support for engagement strategies and structures that facilitate participation and meaning making by students. Most students have the opportunity to engage in discipline-specific meaning making. Teacher sets expectations and provides support for engagement strategies and structures that facilitate participation and meaning making by students. All students have the opportunity to engage in discipline- specific meaning making. Meaning making is often student- led."
    },
    "SE5": {
      "component": "Student talk",
      "distinguished": "Distinguished – 4 Talk is dominated by the teacher and/or student talk is unrelated to the discipline. Student talk is directed to the teacher. Talk reflects discipline- specific knowledge. Students do not provide evidence for their thinking. Student talk is a mix of teacher-student and student-to-student. Talk reflects discipline- specific knowledge and ways of thinking. Students provide evidence to support their thinking. Student talk is predominantly student- to-student. Talk reflects discipline-specific knowledge and ways of thinking. Students provide evidence to support their thinking. Students press on thinking to expand ideas for themselves and others."
    }
  },
  "Criterion 3: Recognizing individual student learning needs and developing strategies to": {
    "CP5": {
      "component": "Use of scaffolds",
      "distinguished": "Distinguished – 4   Teacher does not provide scaffolds that are related to or support the development of the targeted concepts and/or skills. If teacher uses scaffolds, he or she does not release responsibility to students. Teacher provides scaffolds that are clearly related to and support the development of the targeted concepts and/or skills. Using scaffolds, the teacher gradually releases responsibility to students to promote learning and independence. Teacher provides scaffolds that are clearly related to and support the development of the targeted concepts and/or skills. Using scaffolds, the teacher gradually releases responsibility to students to promote learning and independence. Students expect to be self-reliant. Teacher provides scaffolds that are clearly related to and support the development of the targeted concepts and/or skills. Using scaffolds, the teacher gradually releases responsibility to students to promote learning and independence. Students expect to be self-reliant. Students use scaffolds across tasks with similar demands.      address those needs."
    },
    "SE2": {
      "component": "Ownership of learning",
      "distinguished": "Distinguished – 4 Teacher rarely provides opportunities and strategies for students to take ownership of their learning. Teacher provides opportunities and strategies for students to take ownership of their learning. Most locus of control is with teacher. Teacher provides opportunities and strategies for students to take ownership of their learning. Some locus of control is with students in ways that support student learning. Teacher provides opportunities and strategies for students to take ownership of their learning. Most locus of control is with students in ways that support student learning."
    },
    "SE3": {
      "component": "Capitalizing on students’ strengths",
      "distinguished": "Distinguished – 4 Teacher has little knowledge of how students’ strengths (academic background, life experiences and culture/language) could be used as an asset for student learning. Teacher has knowledge of students’ strengths (academic background, life experiences and culture/language) and applies this knowledge in limited ways not connected to the unit goals. Teacher capitalizes on students’ strengths (academic background, life experiences and culture/language) and applies this knowledge in limited ways connected to the unit goals. Teacher capitalizes on students’ strengths (academic background, life experiences and culture/language) and applies this knowledge in a variety of ways connected to the unit goals."
    },
    "CP4": {
      "component": "Differentiated instruction for students",
      "distinguished": "Distinguished – 4 Teacher does not use strategies that differentiate for individual learning strengths and needs. Teacher uses one strategy – such as time, space, structure or materials – to differentiate for individual learning strengths and needs. Teacher uses multiple strategies – such as time, space, structure and materials – to differentiate for individual learning strengths and needs. Teacher uses multiple strategies – such as time, space, structure and materials – to differentiate for individual learning strengths and needs. Teacher provides targeted and flexible supports within the strategies."
    }
  },
  "Criterion 4: Providing clear and intentional focus on subject matter content and": {
    "A4": {
      "component": "Teacher use of formative assessments",
      "distinguished": "Distinguished – 4 The teacher provides evidence of student progress on the stated learning goal from only summative assessments.  There is no evidence of student engagement in assessment of their own progress.  There is no evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher does not provide evidence of reflecting on how the learning activities and instructional decisions impacted student learning progress.  The teacher does not identify the next steps for instruction OR the next steps are uninformed by information about students’ progress. The teacher provides evidence of student progress on the stated learning goal, which includes both formative and summative assessments.  There is limited evidence of student engagement in assessment of their own progress.  There is limited or no evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher reflects with supervisor on student learning progress overall, but not for specific students. The reflection may not establish how the learning activities and instructional decisions impacted student progress.  The teacher’s identified next steps for instruction are uninformed by student progress and students’ experience of learning. The teacher provides evidence of student progress on the stated learning goal, which includes both formative and summative assessments.  There is evidence of student engagement in assessment and student monitoring of their own progress.  There is evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher reflects with supervisor on the learning progress for the individual students in this group; the reflection includes an analysis of how the learning activities and instructional decisions impacted student progress.  The teacher uses information from student progress and students’ experience of learning to guide their next steps for instruction. The teacher provides evidence of student progress on the stated learning goal, which includes both formative and summative assessments.  There is evidence of student engagement in assessment and student monitoring of their own progress.  There is evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher reflects with supervisor on learning progress for the individual students in this group; the reflection includes an analysis of how the learning activities and instructional decisions impacted student progress.  The teacher uses information from student progress and students’ experience of learning to: • Guide their next steps for instruction, and • Effect changes in instructional practice or professional learning beyond their own classroom or context.    curriculum."
    },
    "P2": {
      "component": "Lessons connected to previous and future lessons, broader purpose and transferable skill",
      "distinguished": "Distinguished – 4 Lessons are rarely linked to previous and future lessons. Lessons are clearly linked to previous and future lessons. Lessons are clearly linked to previous and future lessons. Lessons link to a broader purpose or a transferable skill. Lessons are clearly linked to previous and future lessons. Lessons link to a broader purpose or a transferable skill. Students can explain how lessons build on each other in a logical progression."
    },
    "CP1": {
      "component": "Alignment of instructional materials and tasks",
      "distinguished": "Distinguished – 4 Instructional materials and tasks do not align with the purpose of the unit and lesson. Instructional materials and tasks align with the purpose of the unit and lesson. Instructional materials and tasks align with the purpose of the unit and lesson. Teacher makes intentional decisions about materials to support student learning of content and transferable skills. Instructional materials and tasks align with the purpose of the unit and lesson. Teacher makes intentional decisions about materials to support student learning of content and transferable skills. Materials and tasks align with students’ levels of challenge."
    },
    "CP2": {
      "component": "Teacher knowledge of content",
      "distinguished": "Distinguished – 4 Teacher demonstrates a lack of knowledge of discipline-based concepts and habits of thinking by making content errors. Teacher demonstrates an understanding of how discipline-based concepts and habits of thinking relate to one another or build upon one another within a unit. Teacher demonstrates an understanding of how discipline-based concepts and habits of thinking relate to one another or build upon one another over the course of an academic year. Teacher demonstrates an understanding of how discipline-based concepts and habits of thinking relate to one another or build upon one another over the course of an academic year as well as in previous and future years."
    },
    "CP3": {
      "component": "Discipline-specific teaching approaches",
      "distinguished": "Distinguished – 4 Teacher rarely uses discipline-specific teaching approaches and strategies that develop students’ conceptual Teacher uses discipline- specific teaching approaches and strategies that develop students’ conceptual understanding and Teacher uses discipline- specific teaching approaches and strategies that develop students’ conceptual understanding and Teacher uses discipline- specific teaching approaches and strategies that develop students’ conceptual understanding and   curriculum. understanding and discipline-specific habits of thinking. discipline-specific habits of thinking at one or two points within a unit. discipline-specific habits of thinking throughout the unit, but not daily. discipline-specific habits of thinking on a daily basis."
    }
  },
  "Criterion 5: Fostering and managing a safe, positive learning environment.": {
    "P3": {
      "component": "Design of performance task",
      "distinguished": "Distinguished – 4 Performance tasks do not require a demonstration of thinking connected to the learning target. Performance tasks require a demonstration of thinking connected to the learning target. Performance tasks require a demonstration of thinking connected to the learning target. Performance tasks require application of discipline-specific concepts or skills. Performance tasks require a demonstration of thinking connected to the learning target. Performance tasks require application of discipline-specific concepts or skills. Students are able to use prior learnings/understandings to engage in new performance tasks."
    },
    "CEC1": {
      "component": "Classroom arrangement and resources",
      "distinguished": "Distinguished – 4 Physical environment of the classroom is unsafe or resources are not accessible to all students to support their learning during the lesson. The physical environment is safe. The resources, materials and technology in the classroom relate to the content or current unit and are accessible to all students. The physical environment is safe. The resources, materials and technology in the classroom relate to the content or current unit and are accessible to all students. The arrangement of the room supports and scaffolds student learning and the purpose of the lesson. The physical environment is safe. The resources, materials and technology in the classroom relate to the content or current unit and are accessible to all students. The arrangement of the room supports and scaffolds student learning and the purpose of the lesson. Students use resources and the arrangement of the room for learning."
    },
    "CEC3": {
      "component": "Use of learning time",
      "distinguished": "Distinguished – 4 Instructional time is frequently disrupted. Some instructional time is lost through inefficient transitions or management routines. Teacher responds to student misbehavior with uneven results. Instructional time is maximized in service of learning through efficient transitions, management routines and positive student discipline. Student misbehavior is rare. Instructional time is maximized in service of learning through efficient transitions, management routines and positive student discipline. Students manage themselves, assist each other in managing behavior, or exhibit no misbehavior."
    },
    "CEC4": {
      "component": "Student status",
      "distinguished": "Distinguished – 4 Teacher does not develop positive teacher-student relationships that attend to students’ well-being. Patterns of interaction or lack of interaction promote rivalry and/or unhealthy competition among students or some students are relegated to low status positions. Teacher demonstrates positive teacher- student relationships that foster students’ well-being. Patterns of interaction between teacher and students and among students may send messages that some students’ contributions are more valuable than others. Teacher and students demonstrate positive teacher-student and student-student relationships that foster students’ well-being and develop their identity as learners. Patterns of interaction between teacher and students and among students indicate that all are valued for their contributions. Teacher and students demonstrate positive teacher-student and student-student relationships that foster students’ well-being and develop their identity as learners. Patterns of interaction between teacher and students and among students indicate that all are valued for their contributions. Teacher   creates opportunities for student status to be elevated."
    }
  },
  "Criterion 6: Using multiple student data elements to modify instruction and improve": {
    "CEC5": {
      "component": "Norms for learning",
      "distinguished": "Distinguished – 4 Classroom norms are not evident and/or do not address risk-taking, collaboration, respect for divergent thinking or students’ cultures. Classroom norms are evident but result in uneven patterns of interaction that do not encourage risk-taking, collaboration, respect for divergent thinking and students’ cultures. Classroom norms are evident and result in patterns of interaction that encourage risk- taking, collaboration, respect for divergent thinking and students’ cultures. Classroom norms are evident and result in patterns of interaction that encourage risk- taking, collaboration, respect for divergent thinking and students’ cultures. Students self- monitor or remind one another of the norms.      student learning."
    },
    "A1": {
      "component": "Student self-assessment",
      "distinguished": "Distinguished – 4 Teacher does not provide an opportunity for students to assess their own learning in relation to the success criteria for the learning target(s). Teacher provides an opportunity for students to assess their own learning in relation to the success criteria for the learning target(s) in ways that may not deepen student understanding of progress toward the target(s). Teacher provides an opportunity for students to assess their own learning in relation to the success criteria for the learning target(s) in ways that deepen student understanding of progress toward the target(s). Teacher provides an opportunity for students to assess their own learning in relation to the success criteria for the learning target(s) in ways that deepen student understanding of progress toward the target(s). Students use success criteria for improvement."
    },
    "A2": {
      "component": "Student use of formative assessments over time",
      "distinguished": "Distinguished – 4 Students do not use formative assessments to assess their own learning. Students use formative assessments at least two to three times per year/course to assess their own learning, determine learning goals, and monitor progress over time. Students use formative assessments at least two to three times per year/course and use formative assessments within a unit or two to assess their own learning, determine learning goals, and monitor progress over time. Students use formative assessments at least two to three times per year/course and use formative assessments within each unit to assess their own learning, determine learning goals, and monitor progress over time."
    },
    "A3": {
      "component": "Quality of formative assessment methods",
      "distinguished": "Distinguished – 4 Assessment tasks are not aligned with the learning target(s). Assessment tasks allow students to demonstrate learning. The quality of the assessment methods provides no information about student thinking and needs. Assessment tasks allow students to demonstrate learning. The quality of the assessment methods provides limited information about student thinking and needs. Assessment tasks allow students to demonstrate learning. The quality of the assessment methods provides comprehensive information about student thinking and needs."
    }
  },
  "Criterion 7: Communicating and collaborating with parents and the school community.": {
    "A5": {
      "component": "Collection systems for formative assessment data",
      "distinguished": "Distinguished – 4 The teacher provides evidence of student progress on the stated learning goal from only summative assessments.  There is no evidence of student engagement in assessment of their own progress.  There is no evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher does not provide evidence of taking responsibility for student learning progress.  The teacher does not identify the next steps for instruction OR the next steps are uninformed by information about students’ progress.  The teacher provides evidence of student progress on the stated learning goal, which includes both formative and summative assessments.  There is limited evidence of student engagement in assessment of their own progress.  There is limited or no evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher reflects with supervisor on student learning progress generally. The reflection may be missing an analysis of why students did or did not make progress, and/or next steps for groups of students or individuals.  The teacher’s identified next steps for instruction are uninformed by student progress and students’ experience of learning. The teacher provides evidence of student progress on the stated learning goal, which includes both formative and summative assessments.  There is evidence of student engagement in assessment and student monitoring of their own progress.  There is evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher reflects with supervisor on the learning progress for three groups of students: Students who • exceeded the learning goal • met or nearly met the learning goal • did not yet meet the learning goal   The reflection includes analysis of why students did or did not make progress, and next steps for each group.  The teacher uses information from student progress and students’ experience of learning to guide their next steps for instruction. The teacher provides evidence of student progress on the stated learning goal, which includes both formative and summative assessments.  There is evidence of student engagement in assessment and student monitoring of their own progress.  There is evidence of opportunities for students to share feedback on how they experienced the learning.  The teacher reflects with supervisor on the learning progress for three groups of students: Students who • exceeded the learning goal • met or nearly met the learning goal • did not yet meet the learning goal   The teacher uses information from student progress and students’ experience of learning to: • Guide their next steps for instruction, and • Effect changes in instructional practice or professional learning beyond their own classroom or context."
    },
    "PCC2": {
      "component": "Communication and collaboration with parents and guardians",
      "distinguished": "Distinguished – 4 Teacher rarely communicates in any manner with parents and guardians about student progress. Teacher communicates with all parents and guardians about goals of instruction and student progress, but usually relies on one method for communication or requires support or reminders. Teacher communicates with all parents and guardians about goals of instruction and student progress using multiple tools to communicate in a timely and positive manner. Teacher considers the language needs of parents and guardians. Teacher communicates with all parents and guardians about goals of instruction and student progress using multiple tools to communicate in a timely and positive manner. Teacher considers the language needs of parents and guardians. Teacher effectively engages in two-way forms of communication and is responsive to parent and guardian insights."
    }
  },
  "Criterion 8: Exhibiting collaborative and collegial practices focused on improving": {
    "PCC3": {
      "component": "Communication within the school community about student progress",
      "distinguished": "Distinguished – 4 Teacher maintains student records. Teacher rarely communicates student progress information to relevant individuals within the school community. Teacher maintains student records. Teacher communicates student progress information to relevant individuals within the school community; however, performance data may have minor flaws or be narrowly defined (e.g., test scores only). Teacher maintains accurate and systematic student records. Teacher communicates student progress information – including both successes and challenges – to relevant individuals within the school community in a timely, accurate and organized manner. Teacher maintains accurate and systematic student records. Teacher communicates student progress information – including both successes and challenges – to relevant individuals within the school community in a timely, accurate and organized manner. Teacher and student communicate accurately and positively about student successes and challenges.      instructional practice and student learning."
    },
    "PCC1": {
      "component": "Collaboration with peers and administrators to improve student learning",
      "distinguished": "Distinguished – 4 Teacher rarely collaborates with peers or engages in inquiry for the purpose of improving instructional practice or student learning. Teacher collaborates and engages in inquiry with peers and administrators for the purpose of improving instructional practice and student learning. Teacher provides minimal contributions. Teacher collaborates and engages in inquiry with peers and administrators for the purpose of improving instructional practice and student learning. Teacher contributes to collaborative work. Teacher collaborates and engages in inquiry with peers and administrators for the purpose of improving instructional practice, and student and teacher learning. Teacher occasionally leads collaborative work and/or teacher serves as a mentor for others’ growth and development."
    },
    "PCC4": {
      "component": "Support of school, district and state curricula, policies and initiatives",
      "distinguished": "Distinguished – 4 Teacher is unaware of or does not support school, district or state initiatives. Teacher violates a district policy or rarely follows district curricula/pacing guide. Teacher supports and has an understanding of school, district and state initiatives. Teacher follows district policies and implements district curricula/pacing guide. Teacher supports and has an understanding of school, district and state initiatives. Teacher follows district policies and implements district curricula/pacing guide. Teacher makes pacing adjustments as appropriate to meet whole-group needs without compromising an aligned curriculum. Teacher supports and looks for opportunities to take on leadership roles in developing and implementing school, district and state initiatives. Teacher follows district policies and implements district curricula/pacing guide. Teacher makes pacing adjustments as appropriate to meet whole-group and individual needs without compromising an aligned curriculum."
    },
    "PCC5": {
      "component": "Ethics and advocacy",
      "distinguished": "Distinguished – 4 The teacher does not collaboratively develop the student growth goal.  OR  Collaboration does not yield a goal that: • Is informed by knowledge of students • Addresses an essential standard for the teacher’s content and grade level • Require cognitive or emotional engagement   The teacher undermines team’s ability to make and implement team decisions and/or does not follow through with team decisions regarding instruction and assessment.   The teacher collaborates with other grade, school, or district team members to develop the student growth goal.  The team uses a single data element to explain how knowledge of students informed the goal.  The goal addresses an essential standard for the teacher’s content and grade level. (Goal may not necessarily be the same for all team members.)  The goal requires students’ cognitive and emotional engagement. The teacher collaborates with other grade, school, or district team members to develop the student growth goal.  The team uses multiple data elements to explain how knowledge of students informed the goal.  The goal addresses an essential standard for the teacher’s content and grade level. (Goal may not necessarily be the same for all team members.)  The goal requires students’ cognitive and emotional engagement.  The teacher follows through with team decisions regarding instruction and assessment.  The teacher collaborates with other grade, school, or district team members to develop the student growth goal.  The team uses multiple data elements to explain how knowledge of students informed the goal.  The goal addresses an essential standard for the teacher’s content and grade level. (Goal may not necessarily be the same for all team members.)  The goal requires students’ cognitive and emotional engagement.  The teacher follows through with team decisions regarding instruction and assessment.  The teacher helps develop other team members’ capacity to be effective."
    }
  }
}